Reference Terraform to demonstrate the problem:

```terraform
terraform {
  # https://github.com/opentofu/opentofu/releases
  required_version = "1.9.0" # Also tested in 1.8; same results

  required_providers {
    spacelift = {
      source  = "spacelift-io/spacelift"
      version = "~> 1.19.0"
    }
    tls = {
      source  = "hashicorp/tls"
      version = "~> 4.0.5"
    }
  }
}

provider "spacelift" {}

resource "tls_private_key" "pool" {
  algorithm = "RSA"
  rsa_bits  = 4096
}

resource "tls_cert_request" "pool" {
  private_key_pem = tls_cert_request.private_key_pem
}

resource "spacelift_worker_pool" "this" {
  space_id    = "FOOBAR-1234ABCD"
  name        = "FOOBAR"
  csr         = base64encode(trimspace(tls_cert_request.pool.cert_request_pem))
}
```

Apply that, so you get a clean ("no changes") plan. Then, run a plan which replaces the TLS private key:

```console
$ tofu apply -replace 'tls_private_key.pool'
...
  # module.worker_pool.spacelift_worker_pool.this must be replaced
-/+ resource "spacelift_worker_pool" "this" {
      ~ config      = "REDACTED" -> (known after apply)
      ~ csr         = "REDACTED" # forces replacement -> (known after apply) # forces replacement
      ~ id          = "REDACTED" -> (known after apply)
        name        = "FOOBAR"
      + private_key = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.worker_pool.tls_cert_request.pool must be replaced
-/+ resource "tls_cert_request" "pool" {
      ~ cert_request_pem = "REDACTED" -> (known after apply)
      ~ id               = "50b5976f5b39e4ca05e7c4ff44c39fca6fc51f4a" -> (known after apply)
      ~ key_algorithm    = "RSA" -> (known after apply)
      ~ private_key_pem  = REDACTED # forces replacement (known after apply) # forces replacement

        # (1 unchanged block hidden)
    }

  # module.worker_pool.tls_private_key.pool will be replaced, as requested
-/+ resource "tls_private_key" "pool" {
      ~ id                            = "0f288aba2cd14db90dd544ae150dee639f22e2cb" -> (known after apply)
      ~ private_key_openssh           = "REDACTED" -> (known after apply)
      ~ private_key_pem               = "REDACTED" -> (known after apply)
      ~ private_key_pem_pkcs8         = "REDACTED" -> (known after apply)
      ~ public_key_fingerprint_md5    = "REDACTED" -> (known after apply)
      ~ public_key_fingerprint_sha256 = "REDACTED" -> (known after apply)
      ~ public_key_openssh            = "REDACTED" -> (known after apply)
      ~ public_key_pem                = "REDACTED" -> (known after apply)
        # (3 unchanged attributes hidden)
    }
```

Note that the change to the `csr` field forces replacement.